In [1]:
import pandas as pd
data_date = pd.read_csv('C:\\Users\\admin3.URTREK\\Documents\\Data_science\\DataScience_New\\DataFrame\\dates.csv' , sep=',')
data_movies = pd.read_csv('C:\\Users\\admin3.URTREK\\Documents\\Data_science\\DataScience_New\\DataFrame\\movies.csv' , sep=',')
data_ratings1 = pd.read_csv('C:\\Users\\admin3.URTREK\\Documents\\Data_science\\DataScience_New\\DataFrame\\ratings1.csv' , sep=',')
data_ratings2 = pd.read_csv('C:\\Users\\admin3.URTREK\\Documents\\Data_science\\DataScience_New\\DataFrame\\ratings2.csv' , sep=',')
#data_da = melb_data.copy()

In [ ]:
data_ratings1['userId'].unique()

In [24]:
data_date['date'].value_counts('max')

2016-04-04 16:39:58    0.001269
2016-04-04 16:39:57    0.001230
2016-04-04 16:39:56    0.000843
2016-04-04 16:39:55    0.000367
1996-03-29 18:36:56    0.000367
                         ...
2003-06-02 15:37:22    0.000010
2009-10-03 04:56:27    0.000010
2016-10-03 15:23:24    0.000010
2014-11-08 03:03:19    0.000010
2015-07-02 11:32:39    0.000010
Name: date, Length: 85043, dtype: float64

Склейка таблиц

три основных метода объединения таблиц: concat(), join() и merge()

In [31]:

data_ratings = pd.concat(
    [data_ratings1, data_ratings2],
    ignore_index=True
    )
display(data_ratings)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [7]:
print('Число строк в таблице ratings: ', data_ratings.shape[0])
print('Число строк в таблице dates: ', data_date.shape[0])
print(data_ratings.shape[0] == data_date.shape[0])

Число строк в таблице ratings:  100837
Число строк в таблице dates:  100836
False

In [9]:
display(data_ratings1.tail(1))
display(data_ratings2.head(1))
#очистить таблицу от дублей
data_ratings = data_ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', data_ratings.shape[0])

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

Число строк в таблице ratings:  100836

In [10]:
#обьеденяем таблицы
ratings_dates = pd.concat([data_ratings, data_date], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                 date
100829     610   164179     5.0  2017-05-03 21:07:11
100830     610   166528     4.0  2017-05-04 06:29:25
100831     610   166534     4.0  2017-05-03 21:53:22
100832     610   168248     5.0  2017-05-03 22:21:31
100833     610   168250     5.0  2017-05-08 19:50:47
100834     610   168252     5.0  2017-05-03 21:19:12
100835     610   170875     3.0  2017-05-03 21:20:15

In [14]:
joined = ratings_dates.join(
    data_movies.set_index('movieId'),
    on='movieId',
    how='left'
)
display(joined.head())

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [15]:
merged = ratings_dates.merge(
    data_movies,
    on='movieId',
    how='left'
)
display(merged.head())

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [16]:
print('Число строк в таблице ratings_dates: ', ratings_dates.shape[0])
print('Число строк в таблице merged: ', merged.shape[0])
print(ratings_dates.shape[0] == merged.shape[0])

Число строк в таблице ratings_dates:  100836
Число строк в таблице merged:  100836
True

In [39]:
items_df = pd.DataFrame({
'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 
'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
})

purchase_df = pd.DataFrame({
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
})

marge1 = items_df.merge(
    purchase_df,
    on='item_id',
    how='outer'
)

marge2 = pd.concat(
    [items_df, purchase_df],
    axis=1
)

merged1 = items_df.merge(purchase_df, how='inner', on='item_id')

print(marge1)
print(merged1)
display(marge2)

#print('Число строк в таблице items_df: ', items_df.shape[0])
#print('Число строк в таблице purchase_df: ', purchase_df.shape[0])
#print(items_df.shape[0] == purchase_df.shape[0])

#merged['total'] =
#income =

    item_id   vendor  stock_count  purchase_id    price
0    417283  Samsung         54.0        101.0  13900.0
1    849734       LG         33.0        101.0   5330.0
2    132223    Apple        122.0        101.0  38200.0
3    573943    Apple         18.0        112.0  49990.0
4     19475       LG        102.0        121.0   9890.0
5   3294095    Apple         43.0        145.0  33000.0
6    382043  Samsung         77.0        145.0  67500.0
7    302948  Samsung        143.0        145.0  34500.0
8    100132       LG         60.0        221.0  11400.0
9    312394      ZTE         19.0          NaN      NaN
10   103845      NaN          NaN        145.0  89900.0
   item_id   vendor  stock_count  purchase_id  price
0   417283  Samsung           54          101  13900
1   849734       LG           33          101   5330
2   132223    Apple          122          101  38200
3   573943    Apple           18          112  49990
4    19475       LG          102          121   9890
5  3294095    Apple           43          145  33000
6   382043  Samsung           77          145  67500
7   302948  Samsung          143          145  34500
8   100132       LG           60          221  11400

   item_id   vendor  stock_count  purchase_id  item_id  price
0   417283  Samsung           54          101   417283  13900
1   849734       LG           33          101   849734   5330
2   132223    Apple          122          101   132223  38200
3   573943    Apple           18          112   573943  49990
4    19475       LG          102          121    19475   9890
5  3294095    Apple           43          145  3294095  33000
6   382043  Samsung           77          145   382043  67500
7   302948  Samsung          143          145   302948  34500
8   100132       LG           60          145   103845  89900
9   312394      ZTE           19          221   100132  11400